[{"doi": null, "title": {"title": "Microbial Quality of Fresh Lettuce Irrigated with Untreated Waste Water Around Aksum University, Central Zone of Tigrai Region"}, "abstract": {"summary": "Vegetables are essential components of the human diet and there is considerable evidence of the health and nutritional benefits related with the consumption of fresh vegetables. However, they can cause health problem if contaminated by pathogenic bacteria. The present study focused on the microbial quality of vegetables irrigated with untreated waste water. Data were analyzed using percentage and tables. The result of the study shows that 100% of the lettuce samples and 75% of the water samples were positive for salmonella spp. On the other hand, higher numbers of coliforms from lettuce were counted ranging from 3.207X103 - 4.063X105cfu/ml. Many people consume and sold lettuce in nearby towns and cause major health problems. Therefore, the present study can be used as an alarm for the concerned bodies to take measure."}, "collection": {"primary": "PUBLICATIONSETHERNET"}, "creation_date": "2018-10-12T16:29:02", "recid": 137, "authors": [{"first_name": "", "last_name": "Teklemichael Tesfaya", "full_name": "Teklemichael Tesfaya"}]},{"doi": null, "title": {"title": "Blood donation practice and associated factors among health professionals in Tigray regional state public hospitals, northern Ethiopia"}, "abstract": {"summary": "Abstract Objective: The demand for blood and blood products are increasing in all part of the globe, especially in the developing nations. However, there is limited information on the level of blood donation practice and their related factors. Therefore, assessing the level of blood donation practice and its determinant factors among health professionals have a paramount importance in designing an effective strategy for sustaining adequate and safe blood provision in the hospitals. Results: Out of 556 health professionals, 266 (47.8%) had ever donated blood in their life time. Age above 30 years (AOR = 2.756 95% CI 1.055–7.197), married health professionals (AOR = 1.729 95% CI 1.091–2.739), health professionals’ knowledge of blood donation (AOR = 3.403 95% CI 2.296–5.044), health professionals’ attitude towards blood donation (AOR = 3.41 95% CI 2.320–5.041) and health professionals who attend degree education (AOR = 0.315 95% CI 0.104–0.950) were significantly associated with blood donation behavior of health professionals. The magnitude of blood donation practice was found low. Therefore, the Ethiopian Red Cross Society and ministry of health should continue increasing the attitude and knowledge of health professionals toward blood donation practices are the key avenues interventions."}, "collection": {"primary": "PUBLICATIONSNADRE"}, "creation_date": "2018-10-12T15:54:58", "recid": 133, "authors": [{"first_name": "", "last_name": "Tsige Tadesse", "full_name": "Tsige Tadesse"}]},{"doi": null, "title": {"title": "Predictors of postpartum contraceptive use in rural Tigray region, northern Ethiopia: a multilevel analysis"}, "abstract": {"summary": "Abstract Background: Postpartum family planning services is one of the recommended public health intervention aimed at reducing maternal and child morbidity and mortalities. However, there is a paucity studies in rural Tigray region. Therefore, determining the level and associated factors of contraceptive use among postpartum women has the potential to contribute in achieving the Ethiopian Health Sector Transformation Plan and to the Sustainable Development Goals on maternal and infant survival. Methods: A community-based cross-sectional study was done among 1109 postpartum women from March 29, 2017 to April 29, 2017. Face –to–face interview was used for data collection. The collected data were entered and cleaned using EPI - INFO version 7statistical software and later exported to and analyzed using STATA version 12. Mixed-effects multilevel logistic regression analysis was used to identify the individual and community-level factors associated with contraception adoption. A two side p-value< 0.05 was considered to be statistically significant. Results: The level of contraceptive use was 38.3%. Individual-level variables such as women belong to fourth (AOR=1.2; 95% CI: 1.1–3.2) and fifth (AOR = 1.5; 95% CI: 1.3–2.5) wealth quintiles were identified as key predictors of contraception use. In addition, partner secondary (AOR = 2.3; 95% CI: 1.8–3.5) and diploma (AOR = 1.2; 95% CI, 1.1–2.6) educational-level and postnatal care (AOR = 2.0; 95% CI: 1.9, 4.3) were also significantly affected contraception use. Community-level variables such as high community-level antenatal care services use (AOR = 2.1; 95% CI: 1.9–4.2) and proximity of women to health facility (AOR = 3.0; 95% CI: 2.7–4.6) were also determinants of contraception uptake. Conclusions: The status of contraceptive use in rural Tigray region was found to be low. It was found that both individual and community-level variables showed a marked determinant on postpartum contraception use. This study suggested that in order to increase contraceptive use the government should focus on increasing postnatal care, antenatal care services use and reduction of poverty level are important avenues for intervention. Keywords: Predictors, Contraception, Postpartum period, Multilevel analysis, Tigray, Ethiopia"}, "collection": {"primary": "PUBLICATIONSNADRE"}, "creation_date": "2018-10-12T15:51:11", "recid": 132, "authors": [{"first_name": "", "last_name": "Teklehaymanot Huluf Abraha", "full_name": "Teklehaymanot Huluf Abraha"}]},{"doi": null, "title": {"title": "Knowledge and associated factors of lactational amenorrhea as a contraception method among postpartum women in Aksum town, Tigray Region, Ethiopia"}, "abstract": {"summary": "Abstract Objectives: The objective of the study was to assess the prevalence of knowledge level and predictors of lactational amenorrhea method (LAM) as method of contraception among women who gave birth a year prior to the study period in the Aksum town, Tigray Region. The study was cross sectional in design conducted from March 25 to April 24, 2015. Results of the study could help the design of family planning strategies. Results: The knowledge status of LAM as a contraceptive method was 8.8% [95% CI 6.4–11%)]. Women who delivered at health institution (AOR = 1.4, 95% CI 1.2–4.3), attended postnatal care (AOR = 1.3, 95% CI 1.2–3.0) and visited home and counseled about family planning by health extension in the last 12 months, (AOR = 1.5, 95% CI 1.3–4.0) were more likely found knowledgeable towards LAM. Secondary and above level of the maternal education was also found a significant predictor variable with LAM as a contraceptive method (AOR = 1.2 95% CI 1.1–4.0). Our findings recommend that to address the knowledge gap of mothers; improving the uptake of maternal health services and strengthening family planning counseling at home are a key area for improving the knowledge level of LAM. Keywords: Lactational amenorrhea method, Knowledge, Contraception, Aksum, Tigray, Ethiopia"}, "collection": {"primary": "PUBLICATIONSNADRE"}, "creation_date": "2018-10-12T15:41:15", "recid": 131, "authors": [{"first_name": "", "last_name": "Teklehaymanot Huluf Abraha", "full_name": "Teklehaymanot Huluf Abraha"}]},{"doi": null, "title": {"title": "Phytase-Producing Bacteria from Extreme Regions in Indonesia"}, "abstract": {"summary": "In this study, 154 isolates capable of producing extracellular phytate-degrading activity were isolated from four soil samples from volcanic areas in Central Java, Indonesia. Six strains with high phytate-degrading activity were selected for strain identification and characterization of the corresponding phytate-degrading enzyme. Blastanalysis of 16S rRNA gene sequences revealed high similarities for all the six isolates to reference sequences belonging to the genus Bacillus. Isolates MS5, MC6, D10 and D16 showed 99% sequence identity to B. cereus, while isolate MC8 exhibited 99% sequence identity to B. aryabhatti and D6 99% sequence identity to B.psychrotolerans. The crude extracellular phytase preparations from the isolates showed following optimal conditions for phytate dephosphorylation: pH 4.0 and 50°C (isolate D10), pH 5.0 and 60°C (isolate MC6, andisolate MS5), pH 6.0 and 50°C (isolate D16) and pH 6.0 and 60°C (isolate D6) and pH 6.0 and 40°C (isolate MC8).Zn2+  and Fe3+ strongly inhibited phytate dephosphorylation with all phytase preparations studied. In the presence of Ca2+ , an increase in phytase activity of 10-15% was obtained."}, "collection": {"primary": "PUBLICATIONSETHERNET"}, "creation_date": "2018-10-12T12:45:24", "recid": 127, "authors": [{"first_name": "", "last_name": "Sajidan", "full_name": "Sajidan"}, {"first_name": "", "last_name": "Rita Wulandari", "full_name": "Rita Wulandari"}, {"first_name": "", "last_name": "Evy Novita Sari", "full_name": "Evy Novita Sari"}, {"first_name": "", "last_name": "Adi Ratriyanto", "full_name": "Adi Ratriyanto"}, {"first_name": "", "last_name": "Hailu Weldekiros", "full_name": "Hailu Weldekiros"}, {"first_name": "", "last_name": "Ralf Greiner", "full_name": "Ralf Greiner"}]}]